In [ ]:
CREATE DATABASE Bank

In [ ]:
USE Bank

In [ ]:
CREATE TABLE Customers (
    cid INT PRIMARY KEY,
    cname VARCHAR(50),
    cdob DATETIME
)

In [ ]:
INSERT INTO Customers VALUES 
(1, 'Alex', '2004-10-07'),
(2, 'Ioana', '1975-09-27')

In [ ]:
CREATE TABLE BankAccounts (
    IBAN VARCHAR(34) PRIMARY KEY,
    currentBalance FLOAT,
    cid INT FOREIGN KEY REFERENCES Customers(cid)
)

In [ ]:
INSERT INTO BankAccounts VALUES 
('1', 100.12, 1),
('2', 24372.57, 2)

In [ ]:
CREATE TABLE Cards (
    cnumber VARCHAR(16) PRIMARY KEY,
    CVV VARCHAR(3),
    IBAN VARCHAR(34) FOREIGN KEY REFERENCES BankAccounts(IBAN)
)

In [ ]:
INSERT INTO Cards VALUES 
('1', '333', '1'),
('2', '444', '2'),
('3', '555', '2')

In [ ]:
CREATE TABLE ATMs (
    aid INT PRIMARY KEY,
    aaddress VARCHAR(100)
)

In [ ]:
INSERT INTO ATMs VALUES 
(1, 'Antim Ivireanul'),
(2, 'Brancusi')

In [ ]:
CREATE TABLE Transactions (
    aid INT FOREIGN KEY REFERENCES ATMs(aid),
    tvalue FLOAT,
    cnumber VARCHAR(16) FOREIGN KEY REFERENCES Cards(cnumber),
    ttime DATETIME
)

In [ ]:
INSERT INTO Transactions VALUES
(1, 100.0, '1', '2025-01-07'),
(2, 1901.0, '1', '2024-12-31'),
(2, 200, '3', '2024-10-23'),
(1, 2005.0, '2', '2025-01-01')

In [ ]:
-- recieve a card and delete all transactions from that card
CREATE PROCEDURE DeleteAllTransactionsFromCard (@CardNo VARCHAR(16)) AS
BEGIN
    DELETE FROM Transactions WHERE cnumber = @CardNo 
END

In [ ]:
-- view that shows the card numbers which have transactions at all atms
CREATE VIEW ShowCardsWithAllATMsTransaction AS
    SELECT C.cnumber 
    FROM Cards C
    WHERE (SELECT COUNT(*) FROM ATMs)
    = (SELECT COUNT(*) FROM Transactions WHERE C.cnumber = cnumber)

In [49]:
CREATE FUNCTION ListCardsWithBigTotal ()
RETURNS TABLE
AS
RETURN (
    SELECT T.cnumber, C.CVV, SUM(T.tvalue) AS "Sum"
    FROM Transactions T
    JOIN Cards C
    ON T.cnumber = C.cnumber
    GROUP BY T.cnumber, C.CVV
    HAVING SUM(T.tvalue) > 2000.0
)